Autodesk.Revit.DB.AssemblyDetailViewOrientation
Orientation of the Assembly Detail View.
Remarks:
The orientation can be specified during creation but not modified for existing views.
Since:
2012

Autodesk.Revit.DB.AssemblyDetailViewOrientation.ElevationBack
The Detail View will be oriented vertically, with its cut plane along the back face of the assembly's bounding box, looking into the bounding box.

Autodesk.Revit.DB.AssemblyDetailViewOrientation.ElevationFront
The Detail View will be oriented vertically, with its cut plane along the front face of the assembly's bounding box, looking into the bounding box.

Autodesk.Revit.DB.AssemblyDetailViewOrientation.ElevationRight
The Detail View will be oriented vertically, with its cut plane along the right face of the assembly's bounding box, looking into the bounding box.

Autodesk.Revit.DB.AssemblyDetailViewOrientation.ElevationLeft
The Detail View will be oriented vertically, with its cut plane along the left face of the assembly's bounding box, looking into the bounding box.

Autodesk.Revit.DB.AssemblyDetailViewOrientation.ElevationBottom
The Detail View will be oriented horizontally, with its cut plane along the bottom face of the assembly's bounding box, looking up into the bounding box.

Autodesk.Revit.DB.AssemblyDetailViewOrientation.ElevationTop
The Detail View will be oriented horizontally, with its cut plane along the top face of the assembly's bounding box, looking down into the bounding box.

Autodesk.Revit.DB.AssemblyDetailViewOrientation.DetailSectionB
The Detail View will be oriented vertically, looking west.

Autodesk.Revit.DB.AssemblyDetailViewOrientation.DetailSectionA
The Detail View will be oriented vertically, looking north.

Autodesk.Revit.DB.AssemblyDetailViewOrientation.HorizontalDetail
The Detail View will be oriented horizontally, looking down.